/*----------------------------------------------------------------------------------------------------------------------
Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

452 -> 11

82 -> 10

9012 -> 12
----------------------------------------------------------------------------------------------------------------------*/

int SumDigits(int x)
{
    int sum = 0;
    while(x > 0)
    {
        sum+=x%10;
        x/=10;
    }
    return sum;
}

Console.Write("Enter natural nuber to calculate it's digits summ: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Summ of digits in {a} is {SumDigits(a)}");


